Tekla.Structures.DirectManipulation.Adapter.Interaction.InputModifiersConvertor
The Tekla.Structures.DirectManipulation.Adapter.Interaction.InputModifiersConvertor class provides a set of extension methods for converting
values between the Tekla.BIM.DirectManipulation.Services.Toleration.InputModifiers and Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers types.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputModifiersConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.InputModifiers)
Converts a value of Tekla.BIM.DirectManipulation.Services.Toleration.InputModifiers to a value of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.
inputModifiers: The value to convert.
Returns: The converted Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputModifiersConvertor.ToInputModifiers(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers)
Converts a value of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers to a value of Tekla.BIM.DirectManipulation.Services.Toleration.InputModifiers.
inputModifiers: The value to convert.
Returns: The converted Tekla.BIM.DirectManipulation.Services.Toleration.InputModifiers value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputModifiersConvertor.ToTolerationModifiers(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers)
Converts a value of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers to a value of Tekla.BIM.DirectManipulation.Services.Toleration.TolerationModifiers.
inputModifiers: The value to convert.
Returns: The converted Tekla.BIM.DirectManipulation.Services.Toleration.TolerationModifiers value.